## Задача 1. Популярные товары

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('2022-04-01T12_df_sales_detail.csv')

In [5]:
df.head()

   sale_id           good  price                 date user_id
0  1000001  mexican pizza    720  2022-02-04 10:00:24  1c1543
1  1000002    chefs pizza    840  2022-02-04 10:02:28  a9a6e8
2  1000002   orange juice     90  2022-02-04 10:02:28  a9a6e8
3  1000003   cheese pizza    600  2022-02-04 10:02:35  23420a
4  1000003  italian pizza    720  2022-02-04 10:02:35  23420a

In [12]:
df.groupby('good')['price'].agg(sum).sort_values(ascending=False)

good
chefs pizza                24558240
double pepperoni pizza     22558380
chicken bbq pizza          17622540
farmhouse pizza            16612440
greek pizza                15976080
meat pizza                 15540000
hawaiian pizza             15471060
pepperoni pizza            15050400
vegetarian pizza           15026040
cheese pizza               15004200
4 cheese pizza             14957280
mexican pizza              14641920
ham and mushrooms pizza    13502280
italian pizza              13088160
margarita pizza            10465200
orange juice                1492920
apple juice                 1379700
sparkling water             1114980
cherry juice                 957510
still water                  823080
Name: price, dtype: int64

> Решение с разбором

In [15]:
df.groupby('good')['price'].agg(sum).sort_values()[-3:]

good
chicken bbq pizza         17622540
double pepperoni pizza    22558380
chefs pizza               24558240
Name: price, dtype: int64

In [16]:
df.groupby('good')['price'].agg(sum).sort_values()[-3:].index.tolist()

['chicken bbq pizza', 'double pepperoni pizza', 'chefs pizza']

In [11]:
import os
import pandas as pd

URL_BASE = 'https://raw.githubusercontent.com/ab-courses/simulator-ab-datasets/main/2022-04-01/'

def read_database(file_name):
    return pd.read_csv(os.path.join(URL_BASE, file_name))

df_sales_detail = read_database('2022-04-01T12_df_sales_detail.csv')
df_sales_detail['date'] = pd.to_datetime(df_sales_detail['date'])
top_3_revenue = (
    df_sales_detail
    .groupby('good')['price'].sum()
    .sort_values()[-3:].index.tolist()
)
print('Ответ:', top_3_revenue)

Ответ: ['chicken bbq pizza', 'double pepperoni pizza', 'chefs pizza']

## Задача 2. Время от захода на сайт до покупки

In [18]:
import os
import pandas as pd

url_first_file = 'https://yadi.sk/d/b6HZoJ9dntvtSw'
url_second_file = 'https://yadi.sk/d/e8GpFppgQQ_n2A'

In [20]:
df_sales = pd.read_csv(os.path.join(url_first_file, '2022-04-01T12_df_sales.csv'))

In [22]:
df_sales = pd.read_csv('2022-04-01T12_df_sales.csv')

In [23]:
df_sales.head()

   sale_id                 date  count_pizza  count_drink  price user_id
0  1000001  2022-02-04 10:00:24            1            0    720  1c1543
1  1000002  2022-02-04 10:02:28            1            1    930  a9a6e8
2  1000003  2022-02-04 10:02:35            3            1   1980  23420a
3  1000004  2022-02-04 10:03:06            1            1    750  3e8ed5
4  1000005  2022-02-04 10:03:23            1            1    870  cbc468

In [24]:
df_web_logs = pd.read_csv('2022-04-01T12_df_web_logs.csv')

In [25]:
df_web_logs.head()

  user_id page                 date  load_time
0  f25239    m  2022-02-03 23:45:37       80.8
1  06d6df    m  2022-02-03 23:49:56       70.5
2  06d6df    m  2022-02-03 23:51:16       89.7
3  f25239    m  2022-02-03 23:51:43       74.4
4  697870    m  2022-02-03 23:53:12       66.8

### Таблицы:
`sales` - информация о покупках, одна строка - один заказ. Атрибуты: \
sale_id - идентификатор покупки; \
date - дата покупки; \
count_pizza - количество пицц в заказе; \
count_drink - количество напитков в заказе; \
price - стоимость заказа; \
user_id - идентификатор пользователя; 

`sales detail` - детализированная информация о покупках, одна строка - один товар в заказе. Атрибуты: \
sale_id - идентификатор покупки; \
good - название товара; \
price - цена товара; \
date - дата покупки; \
user_id - идентификатор пользователя;

`web-logs` - талица с логами посещения сайта. Атрибуты: \
user_id - идентификатор пользователя; \
page - какая страница сайта была открыта. Типы страниц: \
m - страница с меню; \
b - страница с корзиной и потдверждением заказа; \
p - страница с оплатой заказа; \
date - дата открытия страницы; \
load_time - время загрузки страницы в миллисекундах.

In [31]:
from datetime import timedelta

# объединяем таблицы с покупками и логами по пользователям
# оставляем только user_id и времена
df = pd.merge(
    df_sales[['user_id', 'date']].rename(columns={'date': 'date_sale'}),
    df_web_logs[['user_id', 'date']].rename(columns={'date': 'date_web'}),
    on='user_id',
    how='inner'
)

In [35]:
df.head()

  user_id            date_sale             date_web
0  1c1543  2022-02-04 10:00:24  2022-02-04 09:50:02
1  1c1543  2022-02-04 10:00:24  2022-02-04 09:51:16
2  1c1543  2022-02-04 10:00:24  2022-02-04 09:52:58
3  1c1543  2022-02-04 10:00:24  2022-02-04 09:57:04
4  1c1543  2022-02-04 10:00:24  2022-02-04 09:57:28

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4622837 entries, 0 to 4622836
Data columns (total 3 columns):
 #   Column     Dtype
---  ------     -----
 0   user_id    object
 1   date_sale  object
 2   date_web   object
dtypes: object(3)
memory usage: 141.1+ MB

In [38]:
df['date_sale'] = pd.to_datetime(df['date_sale'], unit='ns')
df['date_web'] = pd.to_datetime(df['date_web'], unit='ns')

In [39]:
# удаляем строки, в которых заход на сайт ранее 2 часов до покупки или после покупки
df = df[
    (df['date_web'] >= df['date_sale'] - timedelta(hours=2))
    & (df['date_web'] < df['date_sale'])
].copy()

In [43]:
# определяем время первого захода на сайт для покупки
df_first_web = df.groupby(['user_id', 'date_sale'])[['date_web']].min().reset_index()
df_first_web

       user_id           date_sale            date_web
0       000096 2022-03-04 11:15:55 2022-03-04 10:58:01
1       000096 2022-03-22 13:16:09 2022-03-22 12:57:54
2       0000d4 2022-02-28 16:32:09 2022-02-28 16:13:47
3       0000d4 2022-03-27 11:26:30 2022-03-27 11:09:14
4       0000de 2022-02-11 18:57:15 2022-02-11 18:41:22
...        ...                 ...                 ...
203842  fffcab 2022-03-07 14:44:11 2022-03-07 14:29:17
203843  fffd64 2022-02-18 12:55:14 2022-02-18 12:42:01
203844  ffff62 2022-03-19 20:36:32 2022-03-19 20:20:51
203845  ffff8f 2022-02-05 12:31:36 2022-02-05 12:19:59
203846  ffff8f 2022-02-13 19:27:01 2022-02-13 19:13:39

[203847 rows x 3 columns]

In [44]:
# вычисляем время в секундах
df_first_web['delta'] = (df_first_web['date_sale'] - df_first_web['date_web']).dt.total_seconds()
df_first_web

       user_id           date_sale            date_web   delta
0       000096 2022-03-04 11:15:55 2022-03-04 10:58:01  1074.0
1       000096 2022-03-22 13:16:09 2022-03-22 12:57:54  1095.0
2       0000d4 2022-02-28 16:32:09 2022-02-28 16:13:47  1102.0
3       0000d4 2022-03-27 11:26:30 2022-03-27 11:09:14  1036.0
4       0000de 2022-02-11 18:57:15 2022-02-11 18:41:22   953.0
...        ...                 ...                 ...     ...
203842  fffcab 2022-03-07 14:44:11 2022-03-07 14:29:17   894.0
203843  fffd64 2022-02-18 12:55:14 2022-02-18 12:42:01   793.0
203844  ffff62 2022-03-19 20:36:32 2022-03-19 20:20:51   941.0
203845  ffff8f 2022-02-05 12:31:36 2022-02-05 12:19:59   697.0
203846  ffff8f 2022-02-13 19:27:01 2022-02-13 19:13:39   802.0

[203847 rows x 4 columns]

In [45]:
# считаем среднее время и переводим в минуты
answer = round(df_first_web['delta'].mean() / 60)
print('answer:', answer)

answer: 17

## Задача 3. Удержание клиентов

Интересно, как много пользователей возвращается к нам из месяца в месяц. Какая доля пользователей, совершивших покупку в феврале, совершила покупку и в марте?

Для решения используйте данные из файла `2022-04-01T12_df_sales.csv.`

Ответ округлите с точностью до 2-го знака после точки.

In [49]:
df_sales = pd.read_csv('2022-04-01T12_df_sales.csv')

In [51]:
df_sales.head()

   sale_id                 date  count_pizza  count_drink  price user_id
0  1000001  2022-02-04 10:00:24            1            0    720  1c1543
1  1000002  2022-02-04 10:02:28            1            1    930  a9a6e8
2  1000003  2022-02-04 10:02:35            3            1   1980  23420a
3  1000004  2022-02-04 10:03:06            1            1    750  3e8ed5
4  1000005  2022-02-04 10:03:23            1            1    870  cbc468

In [54]:
df_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 203847 entries, 0 to 203846
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   sale_id      203847 non-null  int64
 1   date         203847 non-null  object
 2   count_pizza  203847 non-null  int64
 3   count_drink  203847 non-null  int64
 4   price        203847 non-null  int64
 5   user_id      203847 non-null  object
dtypes: int64(4), object(2)
memory usage: 9.3+ MB

In [64]:
df_sales['date'] = pd.to_datetime(df_sales['date'], unit='ns')
df_sales.dtypes

sale_id                 int64
date           datetime64[ns]
count_pizza             int64
count_drink             int64
price                   int64
user_id                object
dtype: object

In [65]:
# добавляем столбец с месяцем
df_sales['month'] = df_sales['date'].dt.month
df_sales

,sale_id,date,count_pizza,count_drink,price,user_id,month
0,1000001,2022-02-04 10:00:24,1,0,720,1c1543,2
1,1000002,2022-02-04 10:02:28,1,1,930,a9a6e8,2
2,1000003,2022-02-04 10:02:35,3,1,1980,23420a,2
3,1000004,2022-02-04 10:03:06,1,1,750,3e8ed5,2
4,1000005,2022-02-04 10:03:23,1,1,870,cbc468,2
...,...,...,...,...,...,...,...
203842,1203843,2022-04-01 11:59:15,2,1,1410,7d3869,4
203843,1203844,2022-04-01 11:59:20,1,0,780,b7feae,4
203844,1203845,2022-04-01 11:59:43,1,0,600,7cdcc7,4
203845,1203846,2022-04-01 11:59:45,1,1,630,47b825,4
203846,1203847,2022-04-01 11:59:51,1,0,780,cdaabb,4

In [75]:
# пользователи с покупкой в феврале
users_feb = df_sales[df_sales['month'] == 2]['user_id'].unique().tolist()
users_feb[:5]

['1c1543', 'a9a6e8', '23420a', '3e8ed5', 'cbc468']

In [76]:
# пользователи с покупкой в марте
users_mar = df_sales[df_sales['month'] == 3]['user_id'].unique().tolist()
users_mar[:5]

['043908', 'ad7128', '79ab41', '3f94bc', '7cbf72']

In [77]:
# пользователи с покупкой в феврале и марте
users_feb_mar = list(set(users_feb).intersection(set(users_mar)))

answer = len(users_feb_mar) / len(users_feb)
print('answer:', round(answer, 2))

answer: 0.66